GopalSaraf/Practicals/PSDL/include/proc/pic12hv752.inc
// Register: HLTPR1
#define HLTPR1 HLTPR1
HLTPR1                                   equ 0114h
// bitfield definitions
HLTPR1_HLTPR1_POSN                       equ 0000h
HLTPR1_HLTPR1_POSITION                   equ 0000h
HLTPR1_HLTPR1_SIZE                       equ 0008h
HLTPR1_HLTPR1_LENGTH                     equ 0008h
HLTPR1_HLTPR1_MASK                       equ 00FFh

// Register: HLT1CON0
#define HLT1CON0 HLT1CON0
HLT1CON0                                 equ 0115h
// bitfield definitions
HLT1CON0_H1CKPS_POSN                     equ 0000h
HLT1CON0_H1CKPS_POSITION                 equ 0000h
HLT1CON0_H1CKPS_SIZE                     equ 0002h
HLT1CON0_H1CKPS_LENGTH                   equ 0002h
HLT1CON0_H1CKPS_MASK                     equ 0003h
HLT1CON0_H1ON_POSN                       equ 0002h
HLT1CON0_H1ON_POSITION                   equ 0002h
HLT1CON0_H1ON_SIZE                       equ 0001h
HLT1CON0_H1ON_LENGTH                     equ 0001h
HLT1CON0_H1ON_MASK                       equ 0004h
HLT1CON0_H1OUTPS_POSN                    equ 0003h
HLT1CON0_H1OUTPS_POSITION                equ 0003h
HLT1CON0_H1OUTPS_SIZE                    equ 0004h
HLT1CON0_H1OUTPS_LENGTH                  equ 0004h
HLT1CON0_H1OUTPS_MASK                    equ 0078h
HLT1CON0_H1CKPS0_POSN                    equ 0000h
HLT1CON0_H1CKPS0_POSITION                equ 0000h
HLT1CON0_H1CKPS0_SIZE                    equ 0001h
HLT1CON0_H1CKPS0_LENGTH                  equ 0001h
HLT1CON0_H1CKPS0_MASK                    equ 0001h
HLT1CON0_H1CKPS1_POSN                    equ 0001h
HLT1CON0_H1CKPS1_POSITION                equ 0001h
HLT1CON0_H1CKPS1_SIZE                    equ 0001h
HLT1CON0_H1CKPS1_LENGTH                  equ 0001h
HLT1CON0_H1CKPS1_MASK                    equ 0002h
HLT1CON0_H1OUTPS0_POSN                   equ 0003h
HLT1CON0_H1OUTPS0_POSITION               equ 0003h
HLT1CON0_H1OUTPS0_SIZE                   equ 0001h
HLT1CON0_H1OUTPS0_LENGTH                 equ 0001h
HLT1CON0_H1OUTPS0_MASK                   equ 0008h
HLT1CON0_H1OUTPS1_POSN                   equ 0004h
HLT1CON0_H1OUTPS1_POSITION               equ 0004h
HLT1CON0_H1OUTPS1_SIZE                   equ 0001h
HLT1CON0_H1OUTPS1_LENGTH                 equ 0001h
HLT1CON0_H1OUTPS1_MASK                   equ 0010h
HLT1CON0_H1OUTPS2_POSN                   equ 0005h
HLT1CON0_H1OUTPS2_POSITION               equ 0005h
HLT1CON0_H1OUTPS2_SIZE                   equ 0001h
HLT1CON0_H1OUTPS2_LENGTH                 equ 0001h
HLT1CON0_H1OUTPS2_MASK                   equ 0020h
HLT1CON0_H1OUTPS3_POSN                   equ 0006h
HLT1CON0_H1OUTPS3_POSITION               equ 0006h
HLT1CON0_H1OUTPS3_SIZE                   equ 0001h
HLT1CON0_H1OUTPS3_LENGTH                 equ 0001h
HLT1CON0_H1OUTPS3_MASK                   equ 0040h

// Register: HLT1CON1
#define HLT1CON1 HLT1CON1
HLT1CON1                                 equ 0116h
// bitfield definitions
HLT1CON1_H1REREN_POSN                    equ 0000h
HLT1CON1_H1REREN_POSITION                equ 0000h
HLT1CON1_H1REREN_SIZE                    equ 0001h
HLT1CON1_H1REREN_LENGTH                  equ 0001h
HLT1CON1_H1REREN_MASK                    equ 0001h
HLT1CON1_H1FEREN_POSN                    equ 0001h
HLT1CON1_H1FEREN_POSITION                equ 0001h
HLT1CON1_H1FEREN_SIZE                    equ 0001h
HLT1CON1_H1FEREN_LENGTH                  equ 0001h
HLT1CON1_H1FEREN_MASK                    equ 0002h
HLT1CON1_H1ERS_POSN                      equ 0002h
HLT1CON1_H1ERS_POSITION                  equ 0002h
HLT1CON1_H1ERS_SIZE                      equ 0003h
HLT1CON1_H1ERS_LENGTH                    equ 0003h
HLT1CON1_H1ERS_MASK                      equ 001Ch
HLT1CON1_H1ERS0_POSN                     equ 0002h
HLT1CON1_H1ERS0_POSITION                 equ 0002h
HLT1CON1_H1ERS0_SIZE                     equ 0001h
HLT1CON1_H1ERS0_LENGTH                   equ 0001h
HLT1CON1_H1ERS0_MASK                     equ 0004h
HLT1CON1_H1ERS1_POSN                     equ 0003h
HLT1CON1_H1ERS1_POSITION                 equ 0003h
HLT1CON1_H1ERS1_SIZE                     equ 0001h
HLT1CON1_H1ERS1_LENGTH                   equ 0001h
HLT1CON1_H1ERS1_MASK                     equ 0008h
HLT1CON1_H1ERS2_POSN                     equ 0004h
HLT1CON1_H1ERS2_POSITION                 equ 0004h
HLT1CON1_H1ERS2_SIZE                     equ 0001h
HLT1CON1_H1ERS2_LENGTH                   equ 0001h
HLT1CON1_H1ERS2_MASK                     equ 0010h

// Register: ANSELA
#define ANSELA ANSELA
ANSELA                                   equ 0185h
// bitfield definitions
ANSELA_ANSA0_POSN                        equ 0000h
ANSELA_ANSA0_POSITION                    equ 0000h
ANSELA_ANSA0_SIZE                        equ 0001h
ANSELA_ANSA0_LENGTH                      equ 0001h
ANSELA_ANSA0_MASK                        equ 0001h
ANSELA_ANSA1_POSN                        equ 0001h
ANSELA_ANSA1_POSITION                    equ 0001h
ANSELA_ANSA1_SIZE                        equ 0001h
ANSELA_ANSA1_LENGTH                      equ 0001h
ANSELA_ANSA1_MASK                        equ 0002h
ANSELA_ANSA2_POSN                        equ 0002h
ANSELA_ANSA2_POSITION                    equ 0002h
ANSELA_ANSA2_SIZE                        equ 0001h
ANSELA_ANSA2_LENGTH                      equ 0001h
ANSELA_ANSA2_MASK                        equ 0004h
ANSELA_ANSA4_POSN                        equ 0004h
ANSELA_ANSA4_POSITION                    equ 0004h
ANSELA_ANSA4_SIZE                        equ 0001h
ANSELA_ANSA4_LENGTH                      equ 0001h
ANSELA_ANSA4_MASK                        equ 0010h
ANSELA_ANSA5_POSN                        equ 0005h
ANSELA_ANSA5_POSITION                    equ 0005h
ANSELA_ANSA5_SIZE                        equ 0001h
ANSELA_ANSA5_LENGTH                      equ 0001h
ANSELA_ANSA5_MASK                        equ 0020h

// Register: APFCON
#define APFCON APFCON
APFCON                                   equ 0188h
// bitfield definitions
APFCON_COG1O0SEL_POSN                    equ 0000h
APFCON_COG1O0SEL_POSITION                equ 0000h
APFCON_COG1O0SEL_SIZE                    equ 0001h
APFCON_COG1O0SEL_LENGTH                  equ 0001h
APFCON_COG1O0SEL_MASK                    equ 0001h
APFCON_COG1O1SEL_POSN                    equ 0001h
APFCON_COG1O1SEL_POSITION                equ 0001h
APFCON_COG1O1SEL_SIZE                    equ 0001h
APFCON_COG1O1SEL_LENGTH                  equ 0001h
APFCON_COG1O1SEL_MASK                    equ 0002h
APFCON_COG1FSEL_POSN                     equ 0002h
APFCON_COG1FSEL_POSITION                 equ 0002h
APFCON_COG1FSEL_SIZE                     equ 0001h
APFCON_COG1FSEL_LENGTH                   equ 0001h
APFCON_COG1FSEL_MASK                     equ 0004h
APFCON_T1GSEL_POSN                       equ 0004h
APFCON_T1GSEL_POSITION                   equ 0004h
APFCON_T1GSEL_SIZE                       equ 0001h
APFCON_T1GSEL_LENGTH                     equ 0001h
APFCON_T1GSEL_MASK                       equ 0010h

